{
  "ir_version": "1.0",
  "project": "mcpruntime",
  "repository": "https://github.com/grokify/mcpruntime",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-01-11",
      "highlights": [
        {"description": "OAuth 2.1 Authorization Code + PKCE support for ChatGPT.com and other MCP clients requiring user authentication"},
        {"description": "HTTP server mode with optional ngrok tunnel for public URL exposure"},
        {"description": "Bearer token authentication for protecting MCP endpoints"}
      ],
      "added": [
        {"description": "`ServeHTTP()` method for HTTP transport with graceful shutdown", "commit": "bb710f5"},
        {"description": "`NgrokOptions` for automatic ngrok tunnel creation with custom domain support", "commit": "bb710f5"},
        {"description": "`OAuth2Options` for OAuth 2.1 Authorization Code + PKCE authentication", "commit": "bb710f5"},
        {"description": "`oauth2server` package implementing RFC 7636 (PKCE), RFC 7591 (DCR), RFC 8414, RFC 9728", "commit": "bb710f5"},
        {"description": "Bearer token authentication middleware for protected MCP endpoints", "commit": "bb710f5"},
        {"description": "`HTTPServerResult` with local and public URLs plus OAuth credentials", "commit": "bb710f5"},
        {"description": "`OnReady` callback in `HTTPServerOptions` for server lifecycle events", "commit": "bb710f5"}
      ],
      "deprecated": [
        {"description": "`OAuthOptions` (client_credentials only) in favor of `OAuth2Options` with full OAuth 2.1 PKCE support", "commit": "bb710f5"}
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-10",
      "highlights": [
        {"description": "Library-first MCP runtime: define tools, prompts, and resources once, invoke them directly as Go functions or expose over MCP transports"},
        {"description": "Zero JSON-RPC overhead in library mode for unit testing, embedding, and serverless use cases"},
        {"description": "Full MCP SDK compatibility with escape hatch for advanced features"}
      ],
      "added": [
        {"description": "`Runtime` type wrapping `mcp.Server` with dual execution modes (library and server)", "commit": "1e973a1"},
        {"description": "`New()` constructor with `Options` for runtime configuration", "commit": "1e973a1"},
        {"description": "`MCPServer()` escape hatch for advanced MCP SDK access", "commit": "1e973a1"},
        {"description": "`Implementation()` getter for server identity", "commit": "1e973a1"},
        {"description": "`AddTool[In, Out]()` generic helper with automatic schema inference", "commit": "f7b0c03"},
        {"description": "`AddToolHandler()` low-level tool registration", "commit": "f7b0c03"},
        {"description": "`CallTool()` for library-mode direct invocation", "commit": "1e973a1"},
        {"description": "`RemoveTools()`, `ListTools()`, `HasTool()`, `ToolCount()` tool management methods", "commit": "1e973a1"},
        {"description": "`AddPrompt()` for prompt registration", "commit": "2f85413"},
        {"description": "`GetPrompt()` for library-mode direct invocation", "commit": "2f85413"},
        {"description": "`RemovePrompts()`, `ListPrompts()`, `HasPrompt()`, `PromptCount()` prompt management methods", "commit": "2f85413"},
        {"description": "`AddResource()` for static resource registration", "commit": "a7e7816"},
        {"description": "`AddResourceTemplate()` for dynamic URI template resources (server mode only)", "commit": "a7e7816"},
        {"description": "`ReadResource()` for library-mode direct invocation", "commit": "a7e7816"},
        {"description": "`RemoveResources()`, `RemoveResourceTemplates()` resource removal methods", "commit": "a7e7816"},
        {"description": "`ListResources()`, `HasResource()`, `ResourceCount()` resource management methods", "commit": "a7e7816"},
        {"description": "`ServeStdio()` for stdio transport (subprocess mode)", "commit": "d9ed342"},
        {"description": "`ServeIO()` for custom IO streams", "commit": "d9ed342"},
        {"description": "`Serve()` for custom MCP transports", "commit": "d9ed342"},
        {"description": "`Connect()` for session-based connections", "commit": "d9ed342"},
        {"description": "`StreamableHTTPHandler()` for HTTP/SSE transport", "commit": "d9ed342"},
        {"description": "`SSEHandler()` for legacy SSE transport", "commit": "d9ed342"},
        {"description": "`InMemorySession()` for testing with full MCP semantics", "commit": "d9ed342"}
      ],
      "documentation": [
        {"description": "Comprehensive README with library and server mode examples", "commit": "9d08047"},
        {"description": "Feature comparison matrix (library vs server mode)", "commit": "9d08047"},
        {"description": "MCP feature adoption guidance", "commit": "9d08047"},
        {"description": "Full API reference documentation", "commit": "9d08047"}
      ]
    }
  ]
}
